# ViewSolarstudyStillTimeText Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudyStillTimeText Property
ParameterTypeId Class See Also
---
"Still time text"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudyStillTimeText { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudyStillTimeText As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudyStillTimeText {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace